In [3]:
import pandas as pd
import numpy as np

In [4]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texa', 'Oregon'])

In [6]:
frame

               b         d         e
Utah    0.106911  1.020314 -0.195640
Ohio   -1.098093  0.192910 -0.341590
Texa   -0.322756  0.336927 -1.758672
Oregon -0.004102 -1.415826  0.243636

In [7]:
np.abs(frame)

               b         d         e
Utah    0.106911  1.020314  0.195640
Ohio    1.098093  0.192910  0.341590
Texa    0.322756  0.336927  1.758672
Oregon  0.004102  1.415826  0.243636

In [8]:
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.205004
d    2.436140
e    2.002307
dtype: float64

In [9]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [11]:
frame.apply(f)

            b         d         e
min -1.098093 -1.415826 -1.758672
max  0.106911  1.020314  0.243636

In [12]:
f = lambda x: '%.2f' % x
frame.applymap(f)

            b      d      e
Utah     0.11   1.02  -0.20
Ohio    -1.10   0.19  -0.34
Texa    -0.32   0.34  -1.76
Oregon  -0.00  -1.42   0.24

In [14]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [15]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [16]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                    index=['three', 'one'],
                    columns=['d','a','b','c'])

In [17]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [19]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [20]:
frame.sort_values(by='b')

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [21]:
obj = pd.Series([7, -5, 4, 2, 0, 4])
obj.rank()

0    6.0
1    1.0
2    4.5
3    3.0
4    2.0
5    4.5
dtype: float64

In [22]:
obj.rank(method='first')

0    6.0
1    1.0
2    4.0
3    3.0
4    2.0
5    5.0
dtype: float64

In [23]:
obj.rank(ascending=False, method='max')

0    1.0
1    6.0
2    3.0
3    4.0
4    5.0
5    3.0
dtype: float64

In [24]:
frame.rank(axis='columns')

         d    a    b    c
three  1.0  2.0  3.0  4.0
one    1.0  2.0  3.0  4.0

In [25]:
obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [26]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [27]:
obj.count()

16

In [29]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [30]:
obj.min()

'a'

In [31]:
obj.max()

'c'

In [33]:
obj.sum()

'aabcaabcaabcaabc'

In [35]:
obj.mad()

nan